{
  "name": "Paul",
  "title": "Mechanical Engineer",
  "education": [
    {
      "id": 2,
      "degree": "Master of Science – Mechanical Engineering",
      "school": "University of Nevada, Las Vegas",
      "start_date": "Aug. 2012",
      "graduation_date": "Aug. 2014"
    },
    {
      "id": 3,
      "degree": "Bachelor of Science – Mechanical Engineering",
      "school": "University of Nevada, Las Vegas",
      "start_date": "Aug. 2007",
      "graduation_date": "May. 2012"
    }
  ],
  "skills": [
    "Injection Molded Part Design",
    "CNC Part Design",
    "Photo-realistic Product Rendering",
    "Solidworks",
    "Fusion 360",
    "Autodesk Inventor",
    "Photoshop",
    "Illustrator",
    "Excel",
    "MATLAB",
    "Python"
  ],
  "projects": [
    {
      "id": 1,
      "title": "Graduate Thesis Project",
      "description": "Created a speed controller for an engine on a small aircraft that implemented a PID control algorithm written in C.",
      "dates": "",
      "image": ""
    },
    {
      "id": 2,
      "title": "Open Source Wifi Blinds IoT Electronic Device",
      "description": "",
      "dates": "",
      "image": "",
      "bullets": [
        "Programmed a micro-controller in C to control a motor and get data sensor data.",
        "Created an Android app to control the device over WiFi."
      ],
      "links": [
        {
          "title": "Learn more",
          "url": "https://hackaday.io/project/21467-wifi-blinds-esp8266-iot-device"
        },
        {
          "title": "Micro-controller Source Code",
          "url": "https://gitlab.com/pfjare/wifi-blinds-ESP8266/-/tree/master"
        },
        {
          "title": "Android Source Code",
          "url": "https://gitlab.com/pfjare/wifi-blinds-android/-/tree/master"
        }
      ]
    }
  ],
  "experiences": [
    {
      "id": 1,
      "company": "Rapid Expeditionary Concepts",
      "title": "Mechical Design Consultant",
      "dates": "Oct. 2020 - Present",
      "image": "",
      "bullets": [
        "Design of enclosures for network and radio electronics with significant heat dissipation requirements.",
        "Printed Circuit Board design.",
        "Finite Element Analysis informed design of a structural component on a small aircraft.",
        "Designed CNC machined aluminum parts and carbon fiber reinforced 3D printed parts."
      ]
    },
    {"id": 2,
      "company": "My iCover",
      "title": "Mechical Design Consultant",
      "dates": "Mar. 2017 - Jan. 2020",
      "image": "",
      "bullets": [
        "Developed a set of plastic iPhone accessories for a client.",
        "Created multiple design concepts for each part and further developed the most promising designs.",
        "Performed testing of CNC machined and 3D printed prototypes.",
        "Created photo-realistic product renderings for marketing materials.",
        "Worked with a manufacturer to have the parts injection molded."
      ]
    },
    {
      "id": 3,
      "company": "Dronesmith Technologies",
      "title": "Lead Mechanical Engineer + Software Engineer",
      "dates": "Aug. 2014 - Mar. 2017",
      "image": "",
      "bullets": [
        "Designed the airframe and overall assembly of a quadrotor commercial drone.",
        "Improved the design of mechanical components based on customer feedback and part failure analysis.",
        "Integrated electronic systems into compact mechanical assemblies.",
        "Utilized 3D printed materials for lightweight production parts.",
        "Strengthened plastic parts by removing stress concentration points and optimizing material thickness.",
        "Designed CNC milled and routed parts that served multiple functions and were subject to many design constraints.",
        "Produced mechanical drawings to submit for part manufacturing.",
        "Produced BOMs and detailed cost estimates of products.",
        "Sourced mechanical and electrical components from vendors.",
        "Designed simple printed circuit boards to facilitate the integration electronic components into mechanical assemblies.",
        "Designed a plastic housing for an electronic hardware product that featured a tool-less snap-in assembly.",
        "Created detailed product renderings using Autodesk 3DS Max software.",
        "Created and maintained technical documentation for electronic hardware and software products.",
        "Produced tutorials and wrote example code for software products.",
        "Assisted software engineers with web development tasks.",
        "Demonstrated an ability to improve products in response to customer feedback."
      ]
    }  
    
  ]
}
